org/CS/mfc.org
#+TITLE: MFC Internal
#+KEYWORDS: MFC
#+OPTIONS: H:2 toc:2 num:4 ^:nil
#+SETUPFILE: ../configOrg/level1.org
#+Latex: nil
* Overview
** Four Categories:
- General-purpose classes
- Windows API classes
- Application framework classes
- High-level abstractions
** General-purpose classes
*** CObject
#+BEGIN_VERSE
The Mother of almost all MFC classes.
Deal with run-time type identification, serialization,
diagnostic functions, and support for dynamic object creation.
These features are optional.
#+END_VERSE

CObject uses the services of other MFC classes:
- CArchive provides object persistance
- CDumpContext used by the diagnostic functions to output information
- CRuntimeClass associated with every class derived from CObject and contains info. about the class.

*** collection classes
#+BEGIN_VERSE
Arrays:
CByteArray
CWordArray
CDWordArray
CPtrArray
CObArray: An array of objects derived from CObject.
CStringArray
CUintArray

Linked Lists:
CObList
CPtrList
CStringList

Maps:
CMapPtrToWord
CMapPtrToPtr
CMapStringToOb
CMapStringToPtr
CMapStringToString
CMapWordToPtr
CMapWordToOb
#+END_VERSE
*** exception classes
#+BEGIN_VERSE
CException
CArchiveException
CFileException
CMemoryException
CNotSupportedException
COLEException
CDBException
CResourceException
CUserException: Handles an application-specific exception
#+END_VERSE

*** diagnostic classes
#+BEGIN_VERSE
CMemoryState sturcture:
Provides a handy way of tracking memory leaks.
Can set up memory checkpoint. 
#+END_VERSE
*** other classes
- file classes
  - CFile: standard binary file I/O
  - CStdioFile: buffered I/O file (text file)
  - CMemFile: memory file
- date and time classes
  - CTime
  - CTimeSpan
- string-handling class
  - CString
- CPoint, CSize, CRect
** Windows API classes
Wrap up the windows API.
- dialog box classes
- device context classes
*** CCmdTarget
Holds the message map.
*** CWnd
Derived from CCmdTarget.
**** Frame Windows
- CFrameWnd
  base class for a SDI application
- CMDIFrameWnd
  base for MDI app
**** Dialogs
#+BEGIN_VERSE
CDialog and all controls derived from CWnd
Dialogs:
CFileDialog
CColorDialog
CFontDialog
CPrintDialog
CFindReplaceDialog

CDataExchange: Dialog data exchange and validation.
CPropertySheet
CPropertyPage
#+END_VERSE
**** GDI
#+BEGIN_VERSE
The heart of the Graphic Device Interface(GDI) 
is a device context(DC). Represented by the CDC class.
Other specifc device context classes:
CPaintDC: add BeginPaint(), EndPaint() for use while handling a WM_PAINT message.
CWindowDC
CClientDC: associated with a window's client area.
CMetaFileDC: associated with metafiles.

CGdiObject
| CFont | CPen | CBrush | CBitmap | CPalette | CRgn |
#+END_VERSE

*** CWinThread
#+BEGIN_VERSE
CWinThread encapsulates the WinMain() function.
Supports two different kinds of threads:
#+END_VERSE
- worker thread
- user-interface thread
	just a standard message pump using GetMessage()..DispatchMessage()
*** CWinApp
Derived from CWinThread, represents the standard windows application.
*** Synchronization Object Classes
CSyncObject: base
CCriticalSection 
CSemaphone
CMutex       
CEvent     
CSingleLock 
CMultiLock 
*** Other classes
- CCommandLineInfo
- CWaitCursor
** Application framework classes
Handle the large pieces of a whole application.
- message-pumping logic
- printing
- on-line help
- MFC's doc/view architecture
*** D/V architecture
- CDocTemplate, CSingleDocTemplate, and CMultiDocTemplate
Holds together a document and its views.
- CDocument
- CView
Derived from CWnd. Has famous OnDraw() function.
** High-level abstractions
Including nonbasic feature.
- toolbars
- splitter windows
- status lines
