CS/mfc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>MFC Internal</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="MFC Internal"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-03-21T14:48+0800"/>
<meta name="author" content="ChrisChen"/>
<meta name="description" content=""/>
<meta name="keywords" content="MFC"/>
<link rel="stylesheet" href="../css/stylesheet.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:100%;white-space:nowrap;">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>


<div id="content">
<h1 class="title">MFC Internal</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Overview</a>
<ul>
<li><a href="#sec-1-1">1.1 Four Categories:</a></li>
<li><a href="#sec-1-2">1.2 General-purpose classes</a></li>
<li><a href="#sec-1-3">1.3 Windows API classes</a></li>
<li><a href="#sec-1-4">1.4 Application framework classes</a></li>
<li><a href="#sec-1-5">1.5 High-level abstractions</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Four Categories:</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>General-purpose classes
</li>
<li>Windows API classes
</li>
<li>Application framework classes
</li>
<li>High-level abstractions
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> General-purpose classes</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> CObject</h4>
<div class="outline-text-4" id="text-1-2-1">


<p class="verse">
The Mother of almost all MFC classes.<br/>
Deal with run-time type identification, serialization,<br/>
diagnostic functions, and support for dynamic object creation.<br/>
These features are optional.<br/>
</p>


<p>
CObject uses the services of other MFC classes:
</p><ul>
<li>CArchive provides object persistance
</li>
<li>CDumpContext used by the diagnostic functions to output information
</li>
<li>CRuntimeClass associated with every class derived from CObject and contains info. about the class.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> collection classes</h4>
<div class="outline-text-4" id="text-1-2-2">


<p class="verse">
Arrays:<br/>
CByteArray<br/>
CWordArray<br/>
CDWordArray<br/>
CPtrArray<br/>
CObArray: An array of objects derived from CObject.<br/>
CStringArray<br/>
CUintArray<br/>
<br/>
Linked Lists:<br/>
CObList<br/>
CPtrList<br/>
CStringList<br/>
<br/>
Maps:<br/>
CMapPtrToWord<br/>
CMapPtrToPtr<br/>
CMapStringToOb<br/>
CMapStringToPtr<br/>
CMapStringToString<br/>
CMapWordToPtr<br/>
CMapWordToOb<br/>
</p>


</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> exception classes</h4>
<div class="outline-text-4" id="text-1-2-3">


<p class="verse">
CException<br/>
CArchiveException<br/>
CFileException<br/>
CMemoryException<br/>
CNotSupportedException<br/>
COLEException<br/>
CDBException<br/>
CResourceException<br/>
CUserException: Handles an application-specific exception<br/>
</p>


</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> diagnostic classes</h4>
<div class="outline-text-4" id="text-1-2-4">


<p class="verse">
CMemoryState sturcture:<br/>
Provides a handy way of tracking memory leaks.<br/>
Can set up memory checkpoint. <br/>
</p>


</div>

</div>

<div id="outline-container-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> other classes</h4>
<div class="outline-text-4" id="text-1-2-5">

<ul>
<li>file classes
<ul>
<li>CFile: standard binary file I/O
</li>
<li>CStdioFile: buffered I/O file (text file)
</li>
<li>CMemFile: memory file
</li>
</ul>

</li>
<li>date and time classes
<ul>
<li>CTime
</li>
<li>CTimeSpan
</li>
</ul>

</li>
<li>string-handling class
<ul>
<li>CString
</li>
</ul>

</li>
<li>CPoint, CSize, CRect
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Windows API classes</h3>
<div class="outline-text-3" id="text-1-3">

<p>Wrap up the windows API.
</p><ul>
<li>dialog box classes
</li>
<li>device context classes
</li>
</ul>


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> CCmdTarget</h4>
<div class="outline-text-4" id="text-1-3-1">

<p>Holds the message map.
</p></div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> CWnd</h4>
<div class="outline-text-4" id="text-1-3-2">

<p>Derived from CCmdTarget.
</p><ul>
<li id="sec-1-3-2-1">Frame Windows<br/>
<ul>
<li>CFrameWnd
  base class for a SDI application
</li>
<li>CMDIFrameWnd
  base for MDI app
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1-3-2-2">Dialogs<br/>

<p class="verse">
CDialog and all controls derived from CWnd<br/>
Dialogs:<br/>
CFileDialog<br/>
CColorDialog<br/>
CFontDialog<br/>
CPrintDialog<br/>
CFindReplaceDialog<br/>
<br/>
CDataExchange: Dialog data exchange and validation.<br/>
CPropertySheet<br/>
CPropertyPage<br/>
</p>


</li>
</ul>
<ul>
<li id="sec-1-3-2-3">GDI<br/>

<p class="verse">
The heart of the Graphic Device Interface(GDI) <br/>
is a device context(DC). Represented by the CDC class.<br/>
Other specifc device context classes:<br/>
CPaintDC: add BeginPaint(), EndPaint() for use while handling a WM_PAINT message.<br/>
CWindowDC<br/>
CClientDC: associated with a window's client area.<br/>
CMetaFileDC: associated with metafiles.<br/>
<br/>
CGdiObject<br/>
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">CFont</td><td class="left">CPen</td><td class="left">CBrush</td><td class="left">CBitmap</td><td class="left">CPalette</td><td class="left">CRgn</td><td class="left">\\</td></tr>
</tbody>
</table>

</p>


</li>
</ul>
</div>

</div>

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> CWinThread</h4>
<div class="outline-text-4" id="text-1-3-3">


<p class="verse">
CWinThread encapsulates the WinMain() function.<br/>
Supports two different kinds of threads:<br/>
</p>


<ul>
<li>worker thread
</li>
<li>user-interface thread
    just a standard message pump using GetMessage()..DispatchMessage()
</li>
</ul>

</div>

</div>

<div id="outline-container-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> CWinApp</h4>
<div class="outline-text-4" id="text-1-3-4">

<p>Derived from CWinThread, represents the standard windows application.
</p></div>

</div>

<div id="outline-container-1-3-5" class="outline-4">
<h4 id="sec-1-3-5"><span class="section-number-4">1.3.5</span> Synchronization Object Classes</h4>
<div class="outline-text-4" id="text-1-3-5">

<p>CSyncObject: base
CCriticalSection 
CSemaphone
CMutex       
CEvent     
CSingleLock 
CMultiLock 
</p></div>

</div>

<div id="outline-container-1-3-6" class="outline-4">
<h4 id="sec-1-3-6"><span class="section-number-4">1.3.6</span> Other classes</h4>
<div class="outline-text-4" id="text-1-3-6">

<ul>
<li>CCommandLineInfo
</li>
<li>CWaitCursor
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Application framework classes</h3>
<div class="outline-text-3" id="text-1-4">

<p>Handle the large pieces of a whole application.
</p><ul>
<li>message-pumping logic
</li>
<li>printing
</li>
<li>on-line help
</li>
<li>MFC's doc/view architecture
</li>
</ul>


</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> D/V architecture</h4>
<div class="outline-text-4" id="text-1-4-1">

<ul>
<li>CDocTemplate, CSingleDocTemplate, and CMultiDocTemplate
</li>
</ul>

<p>Holds together a document and its views.
</p><ul>
<li>CDocument
</li>
<li>CView
</li>
</ul>

<p>Derived from CWnd. Has famous OnDraw() function.
</p></div>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> High-level abstractions</h3>
<div class="outline-text-3" id="text-1-5">

<p>Including nonbasic feature.
</p><ul>
<li>toolbars
</li>
<li>splitter windows
</li>
<li>status lines
</li>
</ul>

</div>
</div>
</div>
</div>

</body>
</html>
